set terminal png
set output 'performance_graph.png'
set title 'Зависимость времени умножения от размера матрицы'
set xlabel 'Размер матрицы'
set ylabel 'Время (мс)'
$data1 << EOD
100 4.45
200 45.10
300 143.09
400 328.50
500 475.06
600 761.82
700 1210.19
800 1807.10
900 2705.87
1000 3935.25
EOD
$data2 << EOD
100 3.72
200 26.60
300 79.88
400 213.54
500 253.20
600 425.28
700 757.10
800 1286.69
900 1444.61
1000 2136.09
EOD
$data4 << EOD
100 2.26
200 17.45
300 50.58
400 137.20
500 146.79
600 293.67
700 478.35
800 712.84
900 827.25
1000 1225.43
EOD
$data8 << EOD
100 2.04
200 10.99
300 34.37
400 85.08
500 89.94
600 181.68
700 286.36
800 432.92
900 559.26
1000 784.29
EOD
$data16 << EOD
100 2.56
200 11.73
300 30.13
400 61.70
500 80.58
600 145.68
700 217.08
800 325.95
900 520.77
1000 833.15
EOD
plot $data1 with lines title '1 потоков', $data2 with lines title '2 потоков', $data4 with lines title '4 потоков', $data8 with lines title '8 потоков', $data16 with lines title '16 потоков'